; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block position)
  (:predicates (on ?x - block ?y - block)
           (at ?x - block ?p - position)
           (free ?p - position)
	       (ontable ?x - block)
	       (onload ?x - block)
	       (onDetection2 ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (loadfree)
	       (holding ?x - block)
	       (done)
	       )

  (:action place
	     :parameters (?x - block ?p - position)
	     :precondition (and (holding ?x) (free ?p))
	     :effect
	     (and (not (holding ?x))
		   (not (free ?p))
		   (clear ?x)
		   (handempty)
		   (at ?x ?p) (done)))
		   
  (:action load
         :parameters (?x - block)
         :precondition (and (clear ?x) (ontable ?x) (loadfree) (done))
         :effect
         (and (not (ontable ?x))
           (not (loadfree))
           (onload ?x) (not (done))))
           
  (:action moveonconveyor
         :parameters (?x - block)
         :precondition (and (onload ?x))
         :effect
         (and (loadfree)
           (onDetection2 ?x)))
	     
  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (onDetection2 ?x) (handempty))
	     :effect
	     (and (not (onDetection2 ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))
		   
  (:action pick-from-pos
	     :parameters (?x - block ?p - position)
	     :precondition (and (clear ?x) (at ?x ?p) (handempty))
	     :effect
	     (and (not (at ?x ?p))
		   (not (clear ?x))
		   (not (handempty))
		   (free ?p)
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)
		   (done)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
		   (not (done)))))

; problem
(define (problem dobot01)
(:domain BLOCKS)
(:objects cube_0 cube_1 cube_2 cube_3 cube_4 cube_5 cube_6 cube_7 cube_8 cube_9 - block
pos11 pos12 pos13 pos21 pos22 pos23 pos31 pos32 pos33 - position)
(:init (done)(HANDEMPTY) (loadfree) (free pos11)(free pos12)(free pos13)(free pos21)(free pos22)(free pos23)(free pos31)(free pos32)(free pos33)
(ontable cube_0)(ontable cube_1)(ontable cube_2)(ontable cube_3)(ontable cube_4)(ontable cube_5)(ontable cube_6)(ontable cube_7)(ontable cube_8)(ontable cube_9)
(clear cube_0)(clear cube_1)(clear cube_2)(clear cube_3)(clear cube_4)(clear cube_5)(clear cube_6)(clear cube_7)(clear cube_8)(clear cube_9))
(:goal (and (at cube_1 pos21) (at cube_6 pos22) (at cube_8 pos23) (at cube_0 pos11) (at cube_2 pos12) (at cube_3 pos13) 
(at cube_4 pos31) (at cube_7 pos32) (at cube_9 pos33) (on cube_5 cube_6)))
)

; plan
1. (load cube_0)
   deleted: (ontable cube_0) (loadfree) (done)
   added: (onload cube_0)
   goals met: 0 of 10
2. (moveonconveyor cube_0)
   added: (loadfree) (ondetection2 cube_0)
   goals met: 0 of 10
3. (pick-up cube_0)
   deleted: (ondetection2 cube_0) (clear cube_0) (handempty)
   added: (holding cube_0)
   goals met: 0 of 10
4. (place cube_0 pos11)
   deleted: (holding cube_0) (free pos11)
   added: (clear cube_0) (handempty) (at cube_0 pos11) (done)
   goals met: 1 of 10
5. (load cube_1)
   deleted: (ontable cube_1) (loadfree) (done)
   added: (onload cube_1)
   goals met: 1 of 10
6. (moveonconveyor cube_1)
   added: (loadfree) (ondetection2 cube_1)
   goals met: 1 of 10
7. (pick-up cube_1)
   deleted: (ondetection2 cube_1) (clear cube_1) (handempty)
   added: (holding cube_1)
   goals met: 1 of 10
8. (place cube_1 pos21)
   deleted: (holding cube_1) (free pos21)
   added: (clear cube_1) (handempty) (at cube_1 pos21) (done)
   goals met: 2 of 10
9. (load cube_2)
   deleted: (ontable cube_2) (loadfree) (done)
   added: (onload cube_2)
   goals met: 2 of 10
10. (moveonconveyor cube_2)
   added: (loadfree) (ondetection2 cube_2)
   goals met: 2 of 10
11. (pick-up cube_2)
   deleted: (ondetection2 cube_2) (clear cube_2) (handempty)
   added: (holding cube_2)
   goals met: 2 of 10
12. (place cube_2 pos12)
   deleted: (holding cube_2) (free pos12)
   added: (clear cube_2) (handempty) (at cube_2 pos12) (done)
   goals met: 3 of 10
13. (load cube_3)
   deleted: (ontable cube_3) (loadfree) (done)
   added: (onload cube_3)
   goals met: 3 of 10
14. (moveonconveyor cube_3)
   added: (loadfree) (ondetection2 cube_3)
   goals met: 3 of 10
15. (pick-up cube_3)
   deleted: (ondetection2 cube_3) (clear cube_3) (handempty)
   added: (holding cube_3)
   goals met: 3 of 10
16. (place cube_3 pos13)
   deleted: (holding cube_3) (free pos13)
   added: (clear cube_3) (handempty) (at cube_3 pos13) (done)
   goals met: 4 of 10
17. (load cube_4)
   deleted: (ontable cube_4) (loadfree) (done)
   added: (onload cube_4)
   goals met: 4 of 10
18. (moveonconveyor cube_4)
   added: (loadfree) (ondetection2 cube_4)
   goals met: 4 of 10
19. (pick-up cube_4)
   deleted: (ondetection2 cube_4) (clear cube_4) (handempty)
   added: (holding cube_4)
   goals met: 4 of 10
20. (place cube_4 pos31)
   deleted: (holding cube_4) (free pos31)
   added: (clear cube_4) (handempty) (at cube_4 pos31) (done)
   goals met: 5 of 10
21. (load cube_6)
   deleted: (ontable cube_6) (loadfree) (done)
   added: (onload cube_6)
   goals met: 5 of 10
22. (moveonconveyor cube_6)
   added: (loadfree) (ondetection2 cube_6)
   goals met: 5 of 10
23. (pick-up cube_6)
   deleted: (ondetection2 cube_6) (clear cube_6) (handempty)
   added: (holding cube_6)
   goals met: 5 of 10
24. (place cube_6 pos22)
   deleted: (holding cube_6) (free pos22)
   added: (clear cube_6) (handempty) (at cube_6 pos22) (done)
   goals met: 6 of 10
25. (load cube_5)
   deleted: (ontable cube_5) (loadfree) (done)
   added: (onload cube_5)
   goals met: 6 of 10
26. (moveonconveyor cube_5)
   added: (loadfree) (ondetection2 cube_5)
   goals met: 6 of 10
27. (pick-up cube_5)
   deleted: (ondetection2 cube_5) (clear cube_5) (handempty)
   added: (holding cube_5)
   goals met: 6 of 10
28. (stack cube_5 cube_6)
   deleted: (holding cube_5) (clear cube_6)
   added: (clear cube_5) (handempty) (on cube_5 cube_6) (done)
   goals met: 7 of 10
29. (load cube_7)
   deleted: (ontable cube_7) (loadfree) (done)
   added: (onload cube_7)
   goals met: 7 of 10
30. (moveonconveyor cube_7)
   added: (loadfree) (ondetection2 cube_7)
   goals met: 7 of 10
31. (pick-up cube_7)
   deleted: (ondetection2 cube_7) (clear cube_7) (handempty)
   added: (holding cube_7)
   goals met: 7 of 10
32. (place cube_7 pos32)
   deleted: (holding cube_7) (free pos32)
   added: (clear cube_7) (handempty) (at cube_7 pos32) (done)
   goals met: 8 of 10
33. (load cube_8)
   deleted: (ontable cube_8) (loadfree) (done)
   added: (onload cube_8)
   goals met: 8 of 10
34. (moveonconveyor cube_8)
   added: (loadfree) (ondetection2 cube_8)
   goals met: 8 of 10
35. (pick-up cube_8)
   deleted: (ondetection2 cube_8) (clear cube_8) (handempty)
   added: (holding cube_8)
   goals met: 8 of 10
36. (place cube_8 pos23)
   deleted: (holding cube_8) (free pos23)
   added: (clear cube_8) (handempty) (at cube_8 pos23) (done)
   goals met: 9 of 10
37. (load cube_9)
   deleted: (ontable cube_9) (loadfree) (done)
   added: (onload cube_9)
   goals met: 9 of 10
38. (moveonconveyor cube_9)
   added: (loadfree) (ondetection2 cube_9)
   goals met: 9 of 10
39. (pick-up cube_9)
   deleted: (ondetection2 cube_9) (clear cube_9) (handempty)
   added: (holding cube_9)
   goals met: 9 of 10
40. (place cube_9 pos33)
   deleted: (holding cube_9) (free pos33)
   added: (clear cube_9) (handempty) (at cube_9 pos33) (done)
   goals met: 10 of 10
